Revit 2024 API
Document.NewSpaceBoundaryLines Method
Creates a new boundary line as an Space border.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ModelCurveArray NewSpaceBoundaryLines(
	SketchPlane sketchPlane,
	CurveArray curves,
	View view
)
Visual Basic
Public Function NewSpaceBoundaryLines ( _
	sketchPlane As SketchPlane, _
	curves As CurveArray, _
	view As View _
) As ModelCurveArray
Visual C++
public:
ModelCurveArray^ NewSpaceBoundaryLines(
	SketchPlane^ sketchPlane,
	CurveArray^ curves,
	View^ view
)
Parameters
sketchPlane
Type: Autodesk.Revit.DB.SketchPlane
The sketch plan
curves
Type: Autodesk.Revit.DB.CurveArray
The geometry curves on which the boundary lines are
view
Type: Autodesk.Revit.DB.View
The View for the new Space
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the sketch plane does not exist in the given document.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the view does not exist in the given document.
See Also
Document Class
Autodesk.Revit.Creation Namespace